Tekla.Structures.Analysis.AnalysisRestraints
The AnalysisRestraints class contains analysis restraints information
for an analysis part.

Tekla.Structures.Analysis.AnalysisRestraints._Start
Start.

Tekla.Structures.Analysis.AnalysisRestraints._End
End.

Tekla.Structures.Analysis.AnalysisRestraints.#ctor
Creates a new analysis restraints instance.

Tekla.Structures.Analysis.AnalysisRestraints.Start
Data related to the first part end.

Tekla.Structures.Analysis.AnalysisRestraints.End
Data related to the second part end.